#Повторение Какая функция выводит/вводит в консоль, как в функции вывода задать конечный символ, арифметические операции приоритет
# Операции с присвоением ...=
#Двоичная система исчисления
number1 = 0b101# чтобы определить число в двоичной форму надо поставить 0b перед записью числа
number = 5 # в двоичной форме 101
print(f"number = {number:0b}")  # number = 101

#Представить 6, 10, 8 в двоичной системе
#Представить 101, 10101, 100001 в десятичной системе
#16-ричная система 0-9 A-F

#Минимальная длина - 1 бит(какие числа можно записать?)
#Кодирование символов: ASCII использует 8 бит(=1байт), Unicode использует от 1 до 4 байт

#Операции над двоичными числами
# & - логическое умножение(если у обоих чисел в одном разряде 1 - возвращает 1, иначе возвращает 0)
# | - логическое сложение(если хоть у одного в одном разряде единица, возвращается единица)
# ^ - логическое или(если у обоих чисел в одном разряде разные цифры, возвращается 1)
# простое шифрование

